#4-----------------------------------------------------------------------------------------------------------------------
a = int(input())
step = 1

while step < a: 
    step *= 3
    
print(step == a)

#8-----------------------------------------------------------------------------------------------------------------------

n = int(input())
st = 0

while st ** 2 <= n:
    st += 1
   
print(st - 1)

#12----------------------------------------------------------------------------------------------------------------------

b = int(input())
stp = 1
digit = 0

while stp <= b:
    stp += 1
    digit += stp
    
print(stp - 1, digit - stp + 1)

#16----------------------------------------------------------------------------------------------------------------------

p = int(input())
km = 10
k = 1
s = 0

while s <= 200:
    km += (km / 100 * p)
    s += km
    k += 1
    
print(s, k)

#20----------------------------------------------------------------------------------------------------------------------

N = int(input())

Bool = 0

while (N > 0) and (Bool == 0):

   if ((N % 10) % 2 != 0):
       print('True')
       Bool = 1
   
if Bool != 1:

   print('False')

//----------------------------------------------------------------------------------------------------------------------
// сделал оставшуюся часть вайлов и все форы на шарпе, потому что на этом мои знания в пайтоне пока что закончились 
static void While24()
    {
        double n, f, f1, f2;
        n = 18;
        f1 = 1;
        f = 0;
        f2 = 1;
        while (f < n)
           f = f2 + f1;
           f2 = f1;
           f1 = f;
        Console.WriteLine(f = n);

    }
static void While28()
    {
        double k, ak1, ak, e;
        e = 10;
        ak1 = 0;
        ak = 2;
        k = 1;
        while (Math.Abs(ak - ak1) >= e)
            k++;
       	    ak1 = ak;
            ak = 2 + 1 / ak1;
            Console.WriteLine(k);
            Console.WriteLine(ak);
            Console.WriteLine(ak1);
        }
    }
}  